Dlubal.RFEM5.MemberEccentricity
Member eccentricity parameters

Dlubal.RFEM5.MemberEccentricity.No
Number

Dlubal.RFEM5.MemberEccentricity.ID
Identifier

Dlubal.RFEM5.MemberEccentricity.Comment
Comment

Dlubal.RFEM5.MemberEccentricity.Tag
Tag

Dlubal.RFEM5.MemberEccentricity.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.MemberEccentricity.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.MemberEccentricity.ReferenceSystem
Reference system

Dlubal.RFEM5.MemberEccentricity.Start
Member start eccentricity i

Dlubal.RFEM5.MemberEccentricity.End
Member end eccentricity j

Dlubal.RFEM5.MemberEccentricity.HorizontalAlignment
Horizontal cross-section alignment

Dlubal.RFEM5.MemberEccentricity.VerticalAlignment
Vertical cross-section alignment

Dlubal.RFEM5.MemberEccentricity.TransverseOffset
Transverse offset from cross-section of other object

Dlubal.RFEM5.MemberEccentricity.ReferenceObjectType
Reference object type

Dlubal.RFEM5.MemberEccentricity.ReferenceObjectNo
Reference object No.

Dlubal.RFEM5.MemberEccentricity.HorizontalAxisOffset
Horizontal axis offset

Dlubal.RFEM5.MemberEccentricity.VerticalAxisOffset
Vertical axis offset

Dlubal.RFEM5.MemberEccentricity.StartAdjoiningMembersOffset
Axial offset from adjoining members at member start

Dlubal.RFEM5.MemberEccentricity.EndAdjoiningMembersOffset
Axial offset from adjoining members at member end

Dlubal.RFEM5.MemberEccentricity.HingeAtStartNode
Member hinge location at start node

Dlubal.RFEM5.MemberEccentricity.HingeAtEndNode
Member hinge location at end node